10/data/attachments/479bb548afbd82b2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Brandon_test_Friend_39117_4</nif:username>
            <nif:friendToBeRequested>soap_friends_3366b451-5789-4053-9ce3-aaa5786d2676</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>